<template>
  <div class="container">
    <el-input v-model="value" placeholder="请输入关键搜索" class="input-item" @keyup.enter.native="submit()" clearable>
        <i slot="append" class="el-icon-search" @click="searchDots()"/>
    </el-input>
    <div class="resultPanel" v-if="visible">
        <div class="results-number">
            <!-- <span class="results-spans" >上一页</span>
            <span class="results-spans" style="width:76px;text-decoration:none;">当前页:&nbsp;</span>
            <span class="results-spans">&nbsp;下一页</span> -->
            <span class="results-spans" id='hidden' @click="_hiddenPanel()">&nbsp;隐藏</span>
        </div>
        <div class="resultMain">
            <ul class="ulResultMain">
                <li class="liResultMain" v-for="(item,idx) in result" :key='idx' @click="_goTo(idx)">
                    <div class="icons">
                        <img class="imgs" :src="item.initUrl" alt="一张宣传图片" />
                    </div>
                    <div>
                        <ul class="subUlResultMain">
                            <li class="ResultMainLis">{{item.name}}</li>
                            <li class="ResultMainLis RMType">类型：{{item.name}}</li>
                        </ul>
                    </div>
                </li>
            </ul>
        </div>
    </div>
  </div>
</template>
<script>
import Camera from 'esri/Camera';
import { mapGetters } from 'vuex';
import Graphic from 'esri/Graphic';
import esriRequest from 'esri/request';
import Point from 'esri/geometry/Point';
import GraphicsLayer from 'esri/layers/GraphicsLayer';
import PictureMarkerSymbol from "esri/symbols/PictureMarkerSymbol";
export default {
    name: 'SearchBox',
    data() {
        return {
            visible:false,
            value: '',
            queryTypes: [{
                id: 'all',
                label: '一键查询'
            }],
            currentQuery: '一键查询',
            result:[],
            resLength:10,
            startPosition:1,
            graphics:[],
            poiData:[{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"参内乡","村名":"美塘村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"光德村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"过溪村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"涝港村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"同美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"土楼村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"仙苑村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"雅兴村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"玉田村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"员宅村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"中标村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"城厢镇","村名":"砖文村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"凤城镇","村名":"光德村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"凤城镇","村名":"美法村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"凤城镇","村名":"上山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"凤城镇","村名":"吾都村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"魁斗镇","村名":"大岭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"龙门镇","村名":"山美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"蓬莱镇","村名":"鹤前村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"尚卿乡","村名":"福林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"尚卿乡","村名":"翰卿村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"尚卿乡","村名":"翰苑村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"尚卿乡","村名":"新楼村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"尚卿乡","村名":"尤俊村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"尚卿乡","村名":"灶坑村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"尚卿乡","村名":"灶美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"西坪镇","村名":"后格村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"安溪县","乡镇":"西坪镇","村名":"西坪村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"龙浔镇","村名":"宝美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"龙浔镇","村名":"丁墘村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"龙浔镇","村名":"丁溪村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"龙浔镇","村名":"金锁社区","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"三班镇","村名":"蔡径村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"三班镇","村名":"东山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"三班镇","村名":"三班村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"三班镇","村名":"泗滨村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"浔中镇","村名":"后所村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"浔中镇","村名":"乐陶村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"浔中镇","村名":"世科村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"浔中镇","村名":"土坂村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"德化县","乡镇":"浔中镇","村名":"浔中村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"惠安县","乡镇":"崇武镇","村名":"龙西村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"惠安县","乡镇":"崇武镇","村名":"五峰村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"惠安县","乡镇":"东园镇","村名":"锦峰村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"惠安县","乡镇":"东园镇","村名":"下垵村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"惠安县","乡镇":"黄塘镇","村名":"接待村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"惠安县","乡镇":"洛阳镇","村名":"杏田村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"安海镇","村名":"庵前村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"安海镇","村名":"可慕村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"安海镇","村名":"前蔡村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"安海镇","村名":"桥头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"安海镇","村名":"桐林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"安海镇","村名":"西安村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"安海镇","村名":"庄头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"庵上村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"岸兜村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"坊脚村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"高坑村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"宫口村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"桂林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"海尾村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"涵埭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"涵口村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"横坂村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"湖中村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"花厅口村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"江头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"鹏头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"苏厝村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"梧埭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"溪边村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"仙石村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"陈埭镇","村名":"洋埭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"柴塔村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"池店村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"赤塘村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"东山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"华洲村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"溜石村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"潘湖村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"钱头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"清濛村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"仕春村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"唐厝村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"浯潭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"梧潭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"溪头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"霞福村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"新店村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"洋茂村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"池店镇","村名":"御辇村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"磁灶镇","村名":"井边村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"磁灶镇","村名":"下官路村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"磁灶镇","村名":"洋尾村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"磁灶镇","村名":"张林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"东石镇","村名":"塔头孙村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"东石镇","村名":"许西坑村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"金井镇","村名":"山苏村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"金井镇","村名":"石圳村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"龙湖镇","村名":"福林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"龙湖镇","村名":"埔锦村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"龙湖镇","村名":"烧灰村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"龙湖镇","村名":"石龟村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"龙湖镇","村名":"梧坑村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"龙湖镇","村名":"新丰村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"龙湖镇","村名":"秀山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"内坑镇","村名":"东宅村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"西滨镇","村名":"跃进村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"英林镇","村名":"三欧村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"英林镇","村名":"英林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"坂头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"旦厝村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"东茂村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"割山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"古厝村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"后埔村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"马坪村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"山前村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"上宅村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"英墩村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"玉湖村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"晋江市","乡镇":"永和镇","村名":"玉溪村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"洛江区","乡镇":"罗溪镇","村名":"柏山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"洛江区","乡镇":"马甲镇","村名":"就南村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"丰州镇","村名":"素雅村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"丰州镇","村名":"桃源村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"丰州镇","村名":"溪丰村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"洪濑镇","村名":"厝斗村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"洪濑镇","村名":"都心村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"洪濑镇","村名":"谯琉村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"洪濑镇","村名":"西林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"洪濑镇","村名":"杨美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"康美镇","村名":"赤岭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"康美镇","村名":"福铁村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"康美镇","村名":"康美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"康美镇","村名":"兰田村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"康美镇","村名":"青山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"乐峰镇","村名":"飞云村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"乐峰镇","村名":"炉山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"乐峰镇","村名":"炉中村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"柳城街道","村名":"露江村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"仑苍镇","村名":"大宇村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"仑苍镇","村名":"仑苍村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"仑苍镇","村名":"园美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"罗东镇","村名":"罗溪村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"梅山镇","村名":"鼎诚村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"梅山镇","村名":"竞丰村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"梅山镇","村名":"蓉中村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"美林街道","村名":"梅亭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"美林街道","村名":"松岭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"美林街道","村名":"玉叶村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"省新镇","村名":"省身村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"石井镇","村名":"下房村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"溪美街道","村名":"莲塘村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"溪美街道","村名":"镇山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"霞美镇","村名":"邱钟村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"霞美镇","村名":"四黄村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"霞美镇","村名":"温山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"霞美镇","村名":"霞美村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"霞美镇","村名":"杏埔村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"霞美镇","村名":"长福村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"南安市","乡镇":"英都镇","村名":"霞溪村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"杆头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"仑后村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"上浦村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"塘边村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"塘后村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"塘头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"雪上村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"宝盖镇","村名":"玉浦村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"蚶江镇","村名":"厝仔村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"蚶江镇","村名":"大厦村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"蚶江镇","村名":"古山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"蚶江镇","村名":"洪窟村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"蚶江镇","村名":"锦亭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"蚶江镇","村名":"水头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"鸿山镇","村名":"东园村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"鸿山镇","村名":"伍堡村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"钞坑村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"港塘村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"古宅村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"华山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"灵峰村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"灵山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"灵狮村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"茂厦村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"彭田村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"前廊村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"仕林村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"塔前村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"灵秀镇","村名":"塘园村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"祥芝镇","村名":"赤湖村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"祥芝镇","村名":"大堡村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"石狮市","乡镇":"永宁镇","村名":"前埔村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"崇武镇","村名":"霞西村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"东园镇","村名":"后港村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"东园镇","村名":"琅山村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"东园镇","村名":"秀土村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"东园镇","村名":"阳光村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"黄塘镇","村名":"省吟村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"洛阳镇","村名":"屿头村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"台商投资区","乡镇":"张坂镇","村名":"黄岭村","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"永春县","乡镇":"桃城镇","村名":"留安社区","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"永春县","乡镇":"桃城镇","村名":"南星社区","经度":"null","纬度":"null"},{"省份":"福建省","地级市":"泉州市","区县":"永春县","乡镇":"桃城镇","村名":"桃溪社区","经度":"null","纬度":"null"},{"省份":"null","地级市":"null","区县":"null","乡镇":"null","村名":"null","经度":"null","纬度":"null"}]
        }
    },
    created(){
        this.insertLayer();
    },
    mouted(){      
    },
    beforeDestroy() {
  },
    watch:{
        value(newV,oldV){
           if(newV==''){
               let mLayers = this.map.layers;
               mLayers.items[mLayers.length-1].visible=false;
               this.result = [];
               this.visible = false;
           }
        }
    },
    methods:{
        imageUrls(){
                return "resource/img/blue_1.png";
        },
        submit(){
            this.searchDots();
        },
        //插入一个空图层供以后删除用。
        insertLayer(){
            setTimeout(()=>{
                let _self = this;
                let graLayer = new GraphicsLayer();
                _self.map.add(graLayer);
            },3000) 
        },
        _hiddenPanel(){
            this.visible = false;
        },
        _goTo(idx){
            let _self = this;
            console.log(idx);
            console.log(_self.result[idx]);
            var cam = new Camera({
            position: new Point({
                type: "point",  // autocasts as new Point()
                x:_self.result[idx].geometry.x,
                y:_self.result[idx].geometry.y,
                z: 39000,
                spatialReference:_self.view.spatialReference
            }),
            heading: 0, // facing due south
            tilt: 0 ,
            });
            _self.view.goTo(cam);
        },
        searchDots(){
            let _self = this;
            let _address = _self.value;
            let _startPosition = _self.startPosition;
            _self.map;
            //请求总个数
              
            _self.poiData;
              
            let url1 = `http://192.168.5.77/geostar/NJ08_POI/geocoding?service=GeoCoding&version=1.0.0&output=json&request=GeoCoder&resultType=result&address=${_address}`;
            //高德请求兴趣点
            // for(let k=0;k<_self.poiData.length;k++){
                  
                // let poiUrl = `http://api.map.baidu.com/geocoding/v3/?address=${_self.poiData[k].村名}&output=json&ak=fDGNe15F49ClDYM0RpTERvj1FMOFywdA&city=泉州`
                // let poiUrl = `https://restapi.amap.com/v3/place/text?parameters&key=b7a8f5114bdbd38a5876202374609ace&keywords=${_self.poiData[k].村名}`
                esriRequest(url1)
                .then((response) => {
                    console.log(response);
                      
                    _response = JSON.parse(response);
                    _self.poiData;
                    if(response.data.status=="NO_RESULTS"){
                            // alert("您输入的地址未查询到，请重新输入。")
                            this.$message.error('您输入的地址未查询到，请重新输入。');
                            return;
                    }
                    _self.visible = true;
                })
                .catch((err) => {
                      
                    console.log(222)
                    console.log(err)
                });
            // }
            //请求具体某一页数据
              
            let url2 = `http://192.168.5.77/geostar/NJ08_POI/geocoding?service=GeoCoding&version=1.0.0&output=json&request=GeoCoder&resultType=result&maxCount=10&startPosition=${_startPosition}&address=${_address}`;
            esriRequest(url2)
                .then((response) => {
                    console.log(333)
                    console.log(response)
                    let res = _self.result;
                    res.length=0;
                    let uriArr=response.data.results[0].result;
                    if(response.data.results[0].result.length>=10){
                        _self.resLength = 10; 
                    }else{
                        _self.resLength = response.data.results[0].result.length;
                    } 
                    //将请求的数据赋值给自定义数组
                    for(let i=0;i<_self.resLength;i++){
                        let item = {name:'',initUrl:'',activeUrl:'',geometry:{x:'',y:'',spatialReference:{}}};
                        item.name = uriArr[i].poiArray[0].name;
                        item.initUrl = `resource/img/blue_${i+1}.png`;
                        item.activeUrl = `resource/img/${i+1}.png`;
                        let dot = JSON.parse(uriArr[i].poiArray[0].geometry);
                        item.geometry.x = dot.x;
                        item.geometry.y = dot.y;
                        item.geometry.spatialReference = dot.spatialReference;
                        res.push(item);
                    }
                    //graphic,将graphic渲染；
                    let graLayer = new GraphicsLayer();
                    _self.graphics= graLayer.graphics;
                    _self.graphics.removeAll();
                    _self.map;
                    for(let k=0;k<_self.resLength;k++){
                          
                        let point = {
                        type: "point",  // autocasts as new Point()
                        x:_self.result[k].geometry.x,
                        y:_self.result[k].geometry.y,
                        spatialReference:_self.view.spatialReference
                        };
                        let markerSymbol = {
                        // type: "simple-marker",
                        type: "picture-marker",
                        url:`resource/img/blue_${k+1}.png`,
                        color: [255, 255, 255],
                        outline:{
                            color:[0,0,0,0.7],
                            width:0.5
                        },
                        size:18,
                        width:"30px",
                        height:"30px"
                        };
                        let pointGraphic = new Graphic({
                        geometry: point,
                        symbol: markerSymbol,
                        popupTemplate:{}
                        });
                        graLayer.graphics.add(pointGraphic);
                    }
                    let mLayers = _self.map.layers;
                    mLayers.items.splice(mLayers.length-1,1)
                    //GraphicsLayer  
                    _self.map.add(graLayer);
                })
                .catch((err) => {
                    console.log(444)
                    console.log(err)
                });
        },
        _addGraphic(feature, showpopup) {
        }
    },
    computed:{
        ...mapGetters(['map','view'])
    }
}
</script>
<style lang="scss" scoped>
$btn-width: 100px;
$split-line-width:1px;
.ResultMainLis{
    // overflow: hidden;//溢出部分隐藏
    // text-overflow: ellipsis;超出用...代替
    white-space: nowrap;//不换行
}
    @keyframes wordsLoop {
        0% {
            transform: translateX(0);
        }
        100% {
            transform: translateX(-150%);
        }
    }
.imgs{
    width:21px;
    height:30px;
    margin-left:3px;
    margin-top:8px;
}
.icons{
    float:left;
    width:35px;
    height:38px;
}
.el-icon-search{
    cursor: pointer;
}
.container{
    font-family: sans-serif;
    font-size:5px !important;
    display: inline-block;
    height: 30px;
    line-height: 30px;
    vertical-align: middle;
    border-radius: 5px;
}
.resultPanel{
    display:block;
    border:2px;
    border-color: black;
    color:black;
    width:239px;;
    height:450px;
    border:0.5px solid darkgray;
    background-color: white;
    border-radius: 10px;
    overflow: hidden !important;
    position:fixed;
}
.results-number{
    display: block;
    position: relative;
    height: 40px;
    text-align: center;
    font-size: 0.75em;
}
.results-spans{
    width:48px;
    height:20px;
    cursor: pointer;
    color: black;
    height:30px;
    line-height:30px;
    margin-top:5px;
    float:left;
}
.results-spans:hover,
.results-spans:focus,
.results-spans:active
{
    text-decoration:underline;
    color:rgb(77,136,232)
}
.resultMain{
    height:calc(100% - 39px);
    overflow-y: auto;
}
.ulResultMain{
    list-style-type: none;
    padding-left: 0;
    padding-right: 0;
    overflow-y: auto;
    width: 238px;
    height: 410px;
    margin-top: 0;
    margin-bottom: 0;
}
.liResultMain{
    overflow-x: hidden;
    overflow-y: hidden;
    width: 100%;
    float: left;
    padding-bottom: 10px;
    background-color: #ffffff;
    height:70px;
    border:0.2px solid #DCDFE6;
    padding-bottom: 10px;
}
.liResultMain:hover{
    background-color:rgb(207,232,252);
   .RMType{
    animation: 5s wordsLoop linear infinite normal;
   }
}
.subUlResultMain{
    text-align: left;
    padding-top: 5px;
    list-style-type: none;
    font-family: "Microsoft YaHei";
    font-size: 13px;
    color: #000;
    line-height: 30px;
    list-style-type: none;
}
</style>